

morse = {
    # Буквы
    'A': '.-',     'B': '-...',   'C': '-.-.',   'D': '-..',    'E': '.',
    'F': '..-.',   'G': '--.',    'H': '....',   'I': '..',     'J': '.---',
    'K': '-.-',    'L': '.-..',   'M': '--',     'N': '-.',     'O': '---',
    'P': '.--.',   'Q': '--.-',   'R': '.-.',    'S': '...',    'T': '-',
    'U': '..-',    'V': '...-',   'W': '.--',    'X': '-..-',   'Y': '-.--',
    'Z': '--..',

    # Цифры
    '1': '.----',  '2': '..---',  '3': '...--',  '4': '....-',  '5': '.....',
    '6': '-....',  '7': '--...',  '8': '---..',  '9': '----.',  '0': '-----',

    # Знаки препинания (опционально)
    # '.': '.-.-.-', ',': '--..--', '?': '..--..', '!': '-.-.--',
}

morse = (
    # Буквы
    ('A', '.-'),     ('B', '-...'),   ('C', '-.-.'),   ('D', '-..'),    ('E', '.'),
    ('F', '..-.'),   ('G', '--.'),    ('H', '....'),   ('I', '..'),     ('J', '.---'),
    ('K', '-.-'),    ('L', '.-..'),   ('M', '--'),     ('N', '-.'),     ('O', '---'),
    ('P', '.--.'),   ('Q', '--.-'),   ('R', '.-.'),    ('S', '...'),    ('T', '-'),
    ('U', '..-'),    ('V', '...-'),   ('W', '.--'),    ('X', '-..-'),   ('Y', '-.--'),
    ('Z', '--..'),   

    # Цифры
    ('0', '-----'),  ('1', '.----'),  ('2', '..---'),  ('3', '...--'),  ('4', '....-'),
    ('5', '.....'),  ('6', '-....'),  ('7', '--...'),  ('8', '---..'),  ('9', '----.'),
    
    # Знаки препинания (опционально)
    # ('.', '.-.-.-'), (',', '--..--'), ('?', '..--..'), ('!', '-.-.--'),
)

morse = list(map(lambda x: (x[0], '1'+x[1].replace('-','1').replace('.','0') ),morse))

morse = sorted(morse, key=lambda x: x[0])


print('//generated arrays')

print('uint8_t sym_to_code_key[] = {',end='')
for sym, code in morse:
	print(f"{ord(sym)},", end='')
print('};\n')


print('uint8_t sym_to_code_value[] = {')
for sym, code in morse:
	num = '0b'+code
	print(f"    {num}, //{sym}")
print('};\n')



morse = sorted(morse, key=lambda x: int(x[1],2))


print('uint8_t code_to_sym_key[] = {')
for sym, code in morse:
	num = '0b'+code
	print(f"    {num}, //{sym}")
print('};\n')

print('char code_to_sym_value[] = {',end='')
for sym, code in morse:
	print(f"'{sym}',", end='')
print('};\n')



print(f'const uint8_t ALPHABET_LEN = {len(morse)};')